Revit 2027 API
FabricRoundingManager.ApplicableTotalLengthRounding Property
 The applicable rounding for Cut Overall Length and Cut Overall Width parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ApplicableTotalLengthRounding { get; }
Public ReadOnly Property ApplicableTotalLengthRounding As Double
	Get
public:
property double ApplicableTotalLengthRounding {
	double get ();
}
member ApplicableTotalLengthRounding : float with get
Property Value
Double
Remarks
 IsActiveOnElement property of ReinforcementSettings FabricRoundingManager has to be true. ApplicableTotalLengthRounding is meaningless if ReinforcementSettings FabricRoundingManager IsActiveOnElement is false.
See Also
Reference
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace